BAS small business/src/InformationRegisters/ИсторияРаботыСКлиентомБанка/ИсторияРаботыСКлиентомБанка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияРаботыСКлиентомБанка</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Загрузка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоДокументовВВыписке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИсходныйФайл</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ФорматированныйФайл</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ФайлОтформатирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПротоколЗагрузки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Кодировка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BAS small business/src/InformationRegisters/ИсторияРаботыСКлиентомБанка/Forms/ФормаФайла/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МенеджерЗаписи = РегистрыСведений.ИсторияРаботыСКлиентомБанка.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Период = Параметры.Период;
	МенеджерЗаписи.Организация = Параметры.Организация;
	МенеджерЗаписи.БанковскийСчет = Параметры.БанковскийСчет;
	МенеджерЗаписи.Прочитать();
	
	Если НЕ МенеджерЗаписи.Выбран() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекстФайла = МенеджерЗаписи.ИсходныйФайл.Получить();
	Кодировка = МенеджерЗаписи.Кодировка;
	
	Если НЕ МенеджерЗаписи.ФайлОтформатирован Тогда
		
		РасскрашенныйТекст = РегистрыСведений.ИсторияРаботыСКлиентомБанка.ОтформатироватьИсходныйФайл(ТекстФайла);
		
		МенеджерЗаписи.ФорматированныйФайл = 
			Новый ХранилищеЗначения(
				РасскрашенныйТекст,
				Новый СжатиеДанных(5));
		МенеджерЗаписи.ФайлОтформатирован = Истина;
		МенеджерЗаписи.Записать();
		
	Иначе
		РасскрашенныйТекст = МенеджерЗаписи.ФорматированныйФайл.Получить();
	КонецЕсли;
	
	СпособПредставления = ХранилищеОбщихНастроек.Загрузить("ОбменСКлиентомБанка", "ПоказыватьФорматированно");
	
	Если СпособПредставления = Неопределено Тогда
		СпособПредставления = Истина;
	КонецЕсли;
	
	НачальноеПредставлениеФорматировано = СпособПредставления;
	Элементы.ФормаФорматированныйВид.Пометка = НачальноеПредставлениеФорматировано;
	
	Элементы.ФормаЗагрузитьСновая.Видимость = МенеджерЗаписи.Загрузка;
	Элементы.ФормаСохранитьНаДиск.Видимость = НЕ МенеджерЗаписи.Загрузка;
	
	УстановитьПредставление();
	
КонецПроцедуры

&НаКлиенте
Процедура ФорматированныйВид(Команда)
	Элементы.ФормаФорматированныйВид.Пометка = НЕ Элементы.ФормаФорматированныйВид.Пометка;
	УстановитьПредставление();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если НЕ (НачальноеПредставлениеФорматировано = Элементы.ФормаФорматированныйВид.Пометка)
		И НЕ ЗавершениеРаботы Тогда
		
		СохранитьНастройкуНаСервере(Элементы.ФормаФорматированныйВид.Пометка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПредставление()
	
	Элементы.РасскрашенныйТекст.Видимость = Элементы.ФормаФорматированныйВид.Пометка;
	Элементы.НеРасскрашенныйТекст.Видимость = НЕ Элементы.ФормаФорматированныйВид.Пометка;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьНастройкуНаСервере(ЗначениеНастройки)
	
	ХранилищеОбщихНастроек.Сохранить("ОбменСКлиентомБанка", "ПоказыватьФорматированно", ЗначениеНастройки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСнова(Команда)
	
	АдресФайлаКОбработке = ПоместитьВоВременноеХранилище(ТекстФайла, УникальныйИдентификатор);
	ПараметрыФормыЗагрузки = Новый Структура;
	ПараметрыФормыЗагрузки.Вставить("АдресФайлаКОбработке", АдресФайлаКОбработке);
	ПараметрыФормыЗагрузки.Вставить("БанковскийСчет", Параметры.БанковскийСчет);
	ПараметрыФормыЗагрузки.Вставить("Организация", Параметры.Организация);
	ПараметрыФормыЗагрузки.Вставить("Период", Параметры.Период);
	ОткрытьФорму("Обработка.СМП_КлиентБанк.Форма.ФормаЗагрузка", ПараметрыФормыЗагрузки);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНаДиск(Команда)
	
	ПараметрыЗаписи = ПолучитьТекстФайлаИКодировку(КлючУникальности);
	Если ПараметрыЗаписи = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Не удалось получить данные из информационной базы!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ТекстовыйПоток = ПараметрыЗаписи.ТекстовыйПоток;
	
	Попытка
		
		ВыгружатьИнтерактивно = Истина;
		Результат = ПолучитьФайл(ТекстовыйПоток, "1c_to_kl.txt", ВыгружатьИнтерактивно);
		
	Исключение
		
		ТекстСообщения = НСтр("ru = 'Не удалось записать данные в файл. Возможно, диск защищен от записи.'");
		ПоказатьПредупреждение(Неопределено, ТекстСообщения);
		
	КонецПопытки
	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекстФайлаИКодировку(Ключ)

	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ТекстФайла", ТекстФайла);
	СтруктураВозврата.Вставить("Кодировка", Кодировка);
	
	ТекстовыйПоток = Новый ТекстовыйДокумент;
	ТекстовыйПоток.ДобавитьСтроку(СтруктураВозврата.ТекстФайла);
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("txt");
	Если Кодировка = "DOS" Тогда
		ТекстовыйПоток.Записать(ИмяВременногоФайла, КодировкаТекста.OEM);
	Иначе
		ТекстовыйПоток.Записать(ИмяВременногоФайла, КодировкаТекста.ANSI);
	КонецЕсли;
	ТекстовыйПоток = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяВременногоФайла), Ключ);
	
	СтруктураВозврата.Вставить("ТекстовыйПоток", ТекстовыйПоток);
	
	// Удаляем временный файл
	Попытка
		УдалитьФайлы(ИмяВременногоФайла);
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при удалении временного файла.'"), УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Возврат СтруктураВозврата;
	
КонецФункции
